-- ============================================================
-- Домашнее задание к лекции «SQL. Введение»
-- Школа Аналитиков · учебная база hh_school
-- Автор: Боталова Валерия Владимировна
-- ============================================================
-- Формат: задания по порядку, каждое начинается с комментария
-- с номером; под каждым запросом — вывод (2–3 предложения).
-- Запрос без вывода не засчитывается.
-- ============================================================

SET search_path TO hh_school;

-- ============================================================
-- БЛОК А. Разминка: термины и структура (текстом)
-- ============================================================

-- ЗАДАНИЕ А1
-- 1. Категория и конкретный тип колонок:
--    vacancies.salary_from        — категория: числовой   тип: int4
--    vacancies.vacancy_name       — категория: текстовый   тип: text
--    vacancies.published_at       — категория: дата и время   тип: timestamp
--    employers.is_accredited_it   — категория: логический  тип: bool
--    responses.created_at         — категория: дата и время   тип: timestamp
--
-- 2. Первичные ключи таблиц:
--    areas: area_id
--    employers: employer_id
--    vacancies: vacancy_id
--    vacancy_details: vacancy_id (Первичный ключ этой таблицы ссылается на первичный ключ другой таблицы vacancies, благодаря чему связь между таблицами 1 к 1)
--    responses: response_id
--
-- 3. Почему vacancy_name не может быть первичным ключом:
--    Запрос для подтверждения числом:
-- запрос:
SELECT 	count(distinct vacancy_name) unic_by_name, 
		count(distinct vacancy_id) unic_by_id, 
		count(*) all_vacancies 
from vacancies;

SELECT 	vacancy_name,
		count(*) Количество_вакансий
from vacancies
group by 1
order by 2 desc
limit 1
-- Вывод: 
--    Первичный ключ служит уникальным идентификатором строки. Результат запроса показывает, что уникальных вакансий по имени - 18,
--	  но в таблице содержится 52 вакансии. Это связано с тем, что в разных компаниях существуют одинаковые позиции, чьи названия
--	  совпадают. В таком случае стоит каждой вакансии присваивать отдельный id, учитывая все строки и значения вакансии.
--    Второй запрос показывает, что самое частое название вакансии - Стажер-аналитик.
-- 4. Что произойдёт при записи строки «по договорённости» в salary_from:
--    Значение salary_from числовое, при вводе текста произойдет ошибка. Такое поведение может предостеречь от ошибок в
--    работе с данными в статистических/математических вычислениях.


-- ============================================================
-- БЛОК Б. Первые запросы: SELECT, WHERE, ORDER BY
-- ============================================================

-- ЗАДАНИЕ Б1
-- Запрос: experience
SELECT distinct experience from vacancies;

-- Запрос: employment
SELECT distinct employment from vacancies;


-- Запрос: professional_role
SELECT distinct professional_role from vacancies;


-- Вывод:
-- Различных значений в:
-- experience - 3 (От 3 до 6 лет, Нет опыта, От 1 года до 3 лет), 
-- employment - 3 (Частичная занятость, Стажировка, Полная занятость),
-- professional_role - 5 (Дата-инженер, Разработчик, Продуктовый аналитик, Аналитик данных, Тестировщик)
-- Проблем с качеством данных нет, каждое значение описывает разные опыт, занятость, и роль, null значения отсутствуют.


-- ЗАДАНИЕ Б2
-- Запрос 1: стажировки в Москве без опыта, вакансия открыта
select v.vacancy_id Номер, 
	   v.vacancy_name Название, 
	   v.salary_from Зарплата_от, 
	   v.published_at::date Дата_публикации
	   from vacancies v
join areas a on v.area_id = a.area_id 
where a.area_name = 'Москва' and v.employment  = 'Стажировка' and v.experience = 'Нет опыта' and v.closed_at is null
order by published_at desc;
-- Запрос 2: топ-10 вакансий по salary_from
-- C фильтром по Москве
select v.vacancy_name Название,
	   v.professional_role Должность,
	   v.salary_from Зарплата_от
	   from vacancies v
join areas a on v.area_id = a.area_id 
where a.area_name = 'Москва' and v.employment  = 'Стажировка' and v.experience = 'Нет опыта' and v.closed_at is null and v.salary_from is not null
order by salary_from desc limit 10;
-- Без фильтра
select v.vacancy_name Название,
	   v.professional_role Должность,
	   v.salary_from Зарплата_от
	   from vacancies v
join areas a on v.area_id = a.area_id 
where v.employment  = 'Стажировка' and v.experience = 'Нет опыта' and v.closed_at is null and v.salary_from is not null
order by salary_from desc limit 10;

-- Вывод:
-- Первый запрос нашел 7 вакансий, второй 9. Можно сделать вывод, что большая часть открытых стажировок без опыта 
-- находится в Москве, за её пределами всего 2 подходящие вакансии. 
-- Также количество вакансий делает ограничение по топ-10 малофункциональным, так как
-- общее количество вакансий под заданный фильтр меньше 10.


-- ЗАДАНИЕ Б3
-- Ловушка 1. NULL — выполнить и объяснить результат
SELECT count(*) FROM vacancies WHERE closed_at = NULL;
SELECT count(*) FROM vacancies WHERE closed_at IS NULL;

-- Ловушка 2. AND / OR — выполнить и объяснить результат
SELECT count(*) FROM vacancies
WHERE area_id = 1 OR area_id = 2 AND experience = 'Нет опыта';

SELECT count(*) FROM vacancies
WHERE (area_id = 1 OR area_id = 2) AND experience = 'Нет опыта';

-- Вывод:
-- 1 ловушка:
-- null в колонке closed_at означает, что вакансия еще открыта. 
-- Так как null - это пустое/неизвестное значение, сравнение с чем угодно, даже с null, приведет к ответу 0/null, что может искривить значения и дать
-- некорректные данные, как в запросах выше. В таблице есть открытые вакансии, но при использовании оператора сравнения, количество таких вакансий равно 0. 
-- Поэтому важно использовать "is null" вместо "= null".
--2 ловушка:
-- Первый запрос составлял список вакансий ИЛИ из города 1, независимо от опыта, ИЛИ из города 2 обязательно без опыта. Это обоснованно приоритетом чтения and и or. 
-- And имеет более высокий приоритет и "слипает" условия рядом (правое и левое), если скобки отсутствуют.
-- Второй: вакансии без опыта из города 1 или 2.  
-- Для поиска вакансий из Питера/Москвы без опыта используется 2 запрос.
-- ============================================================
-- БЛОК В. Агрегации и метрики
-- ============================================================

-- ЗАДАНИЕ В1
-- Запрос 1: счётчики (строки, зарплата указана, направления, работодатели)
select count(*) Число_строк,
	   count(salary_from) Вакансии_с_нижней_зп,
	   count(distinct professional_role) Направления,
	   count(distinct employer_id) Работодатели
	   from vacancies v; 

-- Запрос 2: доля активных вакансий (без JOIN)
select count(closed_at) Закрытые_вакансии,
	   (count(*) - count(closed_at)) Открытые_вакансии,
	   round(100.0 * (count(*) - count(closed_at))/count(*),1) Доля_открытых_вакансий
		from vacancies v; 

-- Вывод:
-- Запрос 1: count(*) - считает все значения (null в том числе),
-- 			 count(column) - считает только известные значения (без null)
--			 count(distinct column) - считает только уникальные значения (без null)
-- По результатам запроса можно увидеть, что всего у нас вакансий (count(*)) 52,
-- вакансии с salary_from без null (count(salary_from)) 44 (то есть вакансий без нижней зп 8 (52 - 44)),
-- а уникальных значений (count(distinct professional_role)) 5.
-- Запрос 2:
-- На данный момент из 52 вакансий открыты 33, что равно 63% от всех вакансий. Закрыты 19 вакансий, это 37%.
-- ЗАДАНИЕ В2
-- Запрос 1: направления — вакансии, работодатели, средняя зарплата
select professional_role Направление,
	   count(*) Количество_вакансий,
	   count(distinct employer_id) Работодатели,
	   round(avg(salary_from),0) Средний_порог_зп
	   from vacancies v 
	   group by professional_role
	   order by count(*) desc;
-- Запрос 2: то же, только направления с ≥ 5 открытыми вакансиями (WHERE + HAVING)
select professional_role Направление,
	   count(*) Количество_вакансий,
	   count(distinct employer_id) Работодатели,
	   round(avg(salary_from),0) Средний_порог_зп
	   from vacancies v 
	   where closed_at is null
	   group by professional_role
	   having count(*) >= 5
	   order by count(*) desc;

-- Вывод:
-- Выводы по 1 запросу:
-- "Больше половины рынка учебной базы занимают аналитики данных (11) и разработчики (8).
-- Самая высокая средняя нижняя граница у разрабочиков (95000), дата-инженеров (79000) и дата-аналитиков (74091)."
-- Но мы не знаем, как именно распределены вакансии по опыту, городам,типу занятости.
-- Выводы, которые я написала выше, не совсем релевантны для разных типов соискателей.
-- По ней не совсем корректно можно определить, какой рынок доступен соискателю. Для этого
-- стоило бы сделать групировку по городу, опыту, занятости, там же посчитать среднее для каждой группы.

--Выводы по 2 запросу:
-- Where - условия до агрегации, в having - после. Попытка подсчета в where приведет к ошибке,
-- т.к. where работает с полной таблицей и всеми значениями, не разделяя на группы.

-- Указанное среднее значение - это среднее во всей вакансии, среди всех групп, городов.
-- Оно не разделено по группам, и поэтому точно ответить, что значит это среднее на данном этапе сложно.
-- Если среди направления много вакансий на полной занятости и старших должностях, общее среднее будет больше,
-- чем если в другой сфере больше вакансий начального уровня и не на полную занятость.
	   
	 
-- ============================================================
-- БЛОК Г. Соединение таблиц
-- ============================================================

-- ЗАДАНИЕ Г1
-- Запрос: топ-5 по salary_from с названием компании и городом (псевдонимы таблиц)
select v.vacancy_name,
	   e.employer_name,
	   a.area_name,
	   v.salary_from 
from vacancies v
join areas a on a.area_id = v.area_id 
join employers e on e.employer_id = v.employer_id
where salary_from is not null
order by salary_from desc
limit 5;
-- Вывод:
-- При вводе area_id возникнет ошибка: неоднозначная ссылка на столбец "area_id". Так происходит, потому что area_id в нескольких таблицах - vacancies, employers, areas
--
-- ЗАДАНИЕ Г2
-- Запрос 1: все работодатели, число вакансий и откликов (LEFT JOIN)
select e.employer_name,
	   count(distinct v.vacancy_id ) Количество_вакансий,
	   count(r.response_id) Количество_откликов
from employers e 
left join vacancies v on e.employer_id = v.employer_id 
left join responses r on r.vacancy_id = v.vacancy_id 
group by e.employer_name
order by Количество_откликов desc;

-- Запрос 2: тот же запрос с INNER JOIN
select e.employer_name,
	   count(distinct v.vacancy_id ) Количество_вакансий,
	   count(r.response_id) Количество_откликов
from employers e 
join vacancies v on e.employer_id = v.employer_id 
join responses r on r.vacancy_id = v.vacancy_id 
group by e.employer_name
order by Количество_откликов desc;


-- Вывод:
-- count(*) считает все строки после соединения, а одна вакансия может иметь несколько откликов, из-за чего количество строк будет больше, чем количество вакансий.
-- После inner join исчезает компания ГринЭнерго, так как у неё нет откликов. Это приводит к ошибке выжившего: видно только компании, собравшие отклики, партнеры без откликов теряются.
-- Для HR-отчета это критично, так как мы не можем диагностировать проблему неэффективных вакансий у молчащих работодателей.
-- В результат inner join попадают только те строки, для которых есть совпадение в обеих таблицах по заданному условию. Left join сохраняет все значения из левой таблицы, даже
-- если совпадений в правой не было.

-- ============================================================
-- БЛОК Д. Функции и финальный кейс
-- ============================================================

-- ЗАДАНИЕ Д1
-- Запрос: помесячная динамика откликов и конверсия
-- (месяц как дата, условный агрегат, nullif в знаменателе)
select date_trunc('month', created_at)::date Месяц,
	   count(*) filter(where status= 'invited') Приглашения,
	   count(*) Отклики,
	   round(100.0 * (count(*) filter(where status= 'invited'))/nullif(count(*),0),0) Конверсия_приглашений,
	   round(100.0 * (count(*) filter(where status= 'viewed'))/nullif(count(*),0),0) Конверсия_просмотров,
	   round(100.0 * (count(*) filter(where status= 'new'))/nullif(count(*),0),0) Конверсия_новых_откликов,
	   round(100.0 * (count(*) filter(where status= 'rejected'))/nullif(count(*),0),0) Конверсия_отказов
from responses r
group by 1
order by 4 desc;

-- Вывод: 
-- Больше всего конверсия в июне, она равна 19.5%.
-- Для более объективной оценки, я проверила конверсию отказов, новых откликов и просмотров. По результатом - в июне 
-- конверсия отказов на 2 месте по наименьшей. Следуя из этого, результатам можно доверять. Количество откликов приемлимое,
-- дополнительные проверки подтвердили этот вывод.
-- Последний месяц (январь) содержит в себе 24 отклика. 
-- Строить тренды или принимать продуктовые решения на основе январских данных нельзя, это неполный период сырых данных.

-- ЗАДАНИЕ Д2
-- Запрос: таблица по направлениям (вакансии, отклики, приглашения,
-- откликов на вакансию, конверсия)
select v.professional_role,
	   count(distinct v.vacancy_id) Количество_вакансий,
	   count(r.response_id) Отклики, 
	   count(*) filter(where r.status= 'invited') Приглашения,
	   round(count(r.response_id)::numeric / nullif(count(distinct v.vacancy_id), 0),1) Отклики_на_вакансию,
	   round(100.0 * (count(r.response_id) filter(where r.status= 'invited'))/nullif(count(r.response_id),0),1) Конверсия_приглашений
from vacancies v 
left join responses r on r.vacancy_id = v.vacancy_id
group by 1
order by 3, 4 desc;
-- Письменные ответы:
-- 1. Совпадает ли направление с наибольшим числом вакансий с направлением
--    с наибольшей конверсией? 
-- Нет, не совпадает. Большее число вакансий у стажеров-аналитиков данных (6 вакансий), но большая конверсия у 
-- джунов-тестировщиков (50%).
-- 2. Какое направление выбрать и почему (опираясь на два столбца):
-- Для выбора направления я бы опиралась на количество откликов и конверсию приглашений. 
-- Опираться исключительно на конверсию не стоит, так как конверсия может быть большой, но не релевантной для анализа,
-- как получается с джуниор тестировщиками. Конверсия равна 50 - но вакансий всего 2, 1 из которых с приглашением. 
-- Нельзя сказать, что каждый второй получает приглашение.
-- 3. Оговорка к выводу:
-- Данные не учитывают качественную воронку (релевантность резюме кандидатов конкретным стекам внутри направлений), 
-- сезонность размещения вакансий и разницу в размере компаний-работодателей, 
-- что делает результат не совсем подходящим для решения о направлении откликов

-- ============================================================
-- БЛОК Е. Со звёздочкой
-- ============================================================

-- ЗАДАНИЕ Е1
-- Исходный запрос (выполнить и посмотреть результат):
-- SELECT v.professional_role,
-- count(*) AS vacancies,
-- sum(v.salary_from) AS total_salary,
-- count(r.response_id) / count(*) AS responses_per_vacancy
-- FROM vacancies v
-- JOIN responses r ON v.vacancy_id = r.vacancy_id
-- WHERE v.closed_at = NULL
-- GROUP BY 1;
--
-- Ошибки (минимум четыре):
-- 1. "= NULL" вместо "is NULL". Невозможно сравнить строку с неизвесностью.
-- 2. count(*) вместо count(distinct v.vacancy_id) для подсчета количества вакансий. После объединения таблиц 
-- строки повторяются и накладываются друг на друга (на одну вакансию может быть несколько откликов).
-- 3. join вместо "left join". Без left в результат не попадут должности без откликов, если таковые будут.
-- 4. count считает строки после JOIN, а не вакансии
-- 5. sum суммирует одну и ту же зарплату несколько раз для вакансий с несколькими откликами
--
-- Исправленный запрос:

SELECT v.professional_role,
count(distinct(v.vacancy_id)) vacancies,
sum(v.salary_from) total_salary,
round(avg(coalesce(r.responses, 0)),0) responses_per_vacancy
FROM vacancies v
left JOIN (
	select vacancy_id,
		   count(*) as responses
	from responses
	group by vacancy_id
) r on r.vacancy_id = v.vacancy_id
WHERE v.closed_at is NULL
GROUP BY 1;
-- Какие два правила из лекции защитили бы от этих ошибок при написании запроса:
-- 1. Сравнение с NULL никогда не истинно — пустоту проверяют оператором IS NULL
-- 2. LEFT JOIN сохраняет все строки левой таблицы: если совпадения нет, поля правой таблицы заполняются NULL
